Tekla Open API Reference for Tekla Structures 2025
GraphicObject.GraphicObjectAttributes.Line Property
 The line attributes of the graphic object. A graphic object always consists of lines.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes Line { get; set; }
Public Property Line As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
GraphicObject.GraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace